In [1]:
import numpy as np
import pandas as pd

In [2]:
Data=pd.read_csv("C:/Users/abhis/Desktop/DSA Dataset/StudentsPerformance.csv")

In [3]:
Data

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group C,some high school,free/reduced,none,0,17,10
1,female,group B,high school,free/reduced,none,8,24,23
2,female,group B,some high school,free/reduced,none,18,32,28
3,female,group B,some college,standard,none,11,38,32
4,female,group C,some college,free/reduced,none,22,39,33
...,...,...,...,...,...,...,...,...
995,male,group E,some college,standard,completed,99,87,81
996,male,group A,some college,standard,completed,100,96,86
997,male,group D,some college,standard,completed,100,97,99
998,male,group E,associate's degree,free/reduced,completed,100,100,93
999,male,group E,bachelor's degree,standard,completed,100,100,100

# Count of Males and Females

In [23]:
Data.groupby("gender").size().reset_index(name='count')

   gender  count
0  female    518
1    male    482

In [20]:
Data.groupby("parental level of education").size()

parental level of education
associate's degree    222
bachelor's degree     118
high school           196
master's degree        59
some college          226
some high school      179
dtype: int64

Here is the count of parental level of education from  highschool level upto masters level.

# Average score for Maths,Reading and Writing based on gender

In [8]:
Data.groupby("gender")["math score"].mean()

gender
female    63.376448
male      68.821577
Name: math score, dtype: float64

In [9]:
Data.groupby("gender")["reading score"].mean()

gender
female    72.590734
male      65.545643
Name: reading score, dtype: float64

In [11]:
Data.groupby("gender")["writing score"].mean()

gender
female    72.467181
male      63.446058
Name: writing score, dtype: float64

Based on gender males have more average score in maths and females have more average score in reading and writing

# Average score for Maths,Reading and Writing based on Test Preparation course

In [13]:
Data.groupby("test preparation course")["math score"].mean()

test preparation course
completed    69.96648
none         63.78972
Name: math score, dtype: float64

In [14]:
Data.groupby("test preparation course")["reading score"].mean()

test preparation course
completed    74.175978
none         66.417445
Name: reading score, dtype: float64

In [15]:
Data.groupby("test preparation course")["writing score"].mean()

test preparation course
completed    74.684358
none         64.457944
Name: writing score, dtype: float64

It is clear that average score of those who completed the test preparation course is more than those who didn't attend

# Variations in scores for Maths,Reading and Writing based on gender

In [38]:
Data.groupby("gender")["math score"].var()

gender
female    256.958593
male      211.889097
Name: math score, dtype: float64

In [39]:
Data.groupby("gender")["writing score"].var()

gender
female    220.369327
male      202.413924
Name: writing score, dtype: float64

In [40]:
Data.groupby("gender")["reading score"].var()

gender
female    207.677438
male      200.211010
Name: reading score, dtype: float64

# Variations in scores for Maths,Reading and Writing based on Test Preparation Course

In [35]:
Data.groupby("test preparation course")["math score"].var()

test preparation course
completed    210.884027
none         246.668662
Name: math score, dtype: float64

In [36]:
Data.groupby("test preparation course")["writing score"].var()

test preparation course
completed    175.202612
none         226.251739
Name: writing score, dtype: float64

In [37]:
Data.groupby("test preparation course")["reading score"].var()

test preparation course
completed    183.265864
none         213.419851
Name: reading score, dtype: float64

# Top 25% students

In [41]:
Data.nlargest(250,["math score"])

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
515,female,group E,some college,standard,none,100,92,97
516,female,group E,bachelor's degree,standard,none,100,100,100
517,female,group E,associate's degree,standard,none,100,100,100
996,male,group A,some college,standard,completed,100,96,86
997,male,group D,some college,standard,completed,100,97,99
...,...,...,...,...,...,...,...,...
428,female,group D,some college,free/reduced,none,77,86,86
429,female,group E,some high school,standard,none,77,79,80
849,male,group A,bachelor's degree,standard,none,77,67,68
850,male,group C,associate's degree,free/reduced,none,77,67,64
851,male,group D,some college,standard,completed,77,62,62

These are the 25% students those obtained top scores in maths